#include "pch.h"

#include <iostream>

//------------------------------------------------------------------------
// IOCP Server
//------------------------------------------------------------------------
int main()
{
	_wsetlocale(LC_ALL, L"korean");
	ServerClass server;

	// 싱글톤 클래스들 초기화
	if (SUCCEEDED(server.Initialize())) // 음수가 아닌 숫자는 성공
	{
		// 서버 쓰레드 돌리기
		server.Update();
	}
	else
	{
		puts("main() IOCPServer Init Failed!");
	}

	// 싱글톤 클래스들 해제
	server.release();

	return 0;
}

// ========================================================================
// puts()함수는 문자열만 출력하는 함수
// printf()함수보다 단순한 함수이기 때문에 (이론적으로) 속도가 빠르다
// 그러므로 문자열만 출력할 경우에는 puts()함수 사용을 선호한다
// (사실상 별 의미없을듯)
// ========================================================================